Revit 2024 API
HorizontalCurveEndpoint.Station Property
 The endpoint's station value.
Namespace: Autodesk.Revit.DB.Infrastructure
Assembly: Autodesk.CivilAlignments.DBApplication (in Autodesk.CivilAlignments.DBApplication.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2021.1
Syntax
C#
public double Station { get; internal set; }
Visual Basic
Public Property Station As Double
	Get
	Friend Set
Visual C++
public:
property double Station {
	double get ();
	internal: void set (double value);
}
See Also
HorizontalCurveEndpoint Class
Autodesk.Revit.DB.Infrastructure Namespace